Revit 2026 API

# AdvancedGlazingSurfaceRoughness Property

---

The property labeled "Roughness" from the "AdvancedGlazing" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SurfaceRoughness { get; }
```
```vb
Public Shared ReadOnly Property SurfaceRoughness As String
	Get
```
```cpp
public:
static property String^ SurfaceRoughness {
	String^ get ();
}
```
```fsharp
static member SurfaceRoughness : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble". This property allows a connected asset.

#### Reference

AdvancedGlazing Class

Autodesk.Revit.DB.Visual Namespace